In [4]:
import pandas as pd
import os

# SQL Alchemy
from sqlalchemy import create_engine
from sqlalchemy import create_engine, inspect

#Create a connection to the University database
engine = create_engine('postgresql://postgres:postgres@localhost/visualization_db')
conn = engine.connect()

#CSV Path
csvpath=(r'Resources/data/')

htmlpath=(r'Resources/data')

In [22]:
#Inspect engine
inspector = inspect(engine)

In [23]:
#Get all table names
inspector.get_table_names()

['bitcoin', 'litecoin', 'etherium', 'doge']

# Doge Upload

In [44]:
#Read the CSV to a dataframe
doge_df = pd.read_csv("Resources/initialData/DOGE-USD-clean.csv")

doge_df.head()

   trade_date  open_price  close_price
0  2015-08-07    0.000168     0.000168
1  2015-08-08    0.000169     0.000158
2  2015-08-09    0.000158     0.000162
3  2015-08-10    0.000162     0.000160
4  2015-08-11    0.000160     0.000164

In [45]:
#Load dataframe into sql table
doge_df.to_sql(name='doge', con=engine, if_exists='append', index=False)

In [46]:
#Query and print first 5 rows from table in sql database
pd.read_sql_query('select * from doge', con=engine).head()

   doge_id  trade_date  open_price  close_price
0        1  2015-08-07    0.000168     0.000168
1        2  2015-08-08    0.000169     0.000158
2        3  2015-08-09    0.000158     0.000162
3        4  2015-08-10    0.000162     0.000160
4        5  2015-08-11    0.000160     0.000164

# Etherium Upload

In [47]:
#Read the CSV to a dataframe
etherium_df = pd.read_csv("Resources/initialData/ETH Clean-USD.csv")

#Print first 5 rows of the dataframe
etherium_df.head()

   trade_date  open_price  close_price
0  2015-08-07    2.831620     2.772120
1  2015-08-08    2.793760     0.753325
2  2015-08-09    0.706136     0.701897
3  2015-08-10    0.713989     0.708448
4  2015-08-11    0.708087     1.067860

In [48]:
#Load dataframe into sql table
etherium_df.to_sql(name='etherium', con=engine, if_exists='append', index=False)

In [49]:
#Query and print first 5 rows from table in sql database
pd.read_sql_query('select * from etherium', con=engine).head()

   etherium_id  trade_date  open_price  close_price
0            1  2015-08-07    2.831620     2.772120
1            2  2015-08-08    2.793760     0.753325
2            3  2015-08-09    0.706136     0.701897
3            4  2015-08-10    0.713989     0.708448
4            5  2015-08-11    0.708087     1.067860

# Litecoin Upload

In [52]:
#Read the CSV to a dataframe
litecoin_df = pd.read_csv("Resources/initialData/LTC Clean-USD.csv")

#Print first 5 rows of the dataframe
litecoin_df.head()

   trade_date  open_price  close_price
0  2015-08-07     4.06334      4.20828
1  2015-08-08     4.22099      3.85475
2  2015-08-09     3.84339      3.89859
3  2015-08-10     3.90080      3.94888
4  2015-08-11     3.94874      4.15955

In [53]:
#Load dataframe into sql table
litecoin_df.to_sql(name='litecoin', con=engine, if_exists='append', index=False)

In [54]:
#Query and print first 5 rows from table in sql database
pd.read_sql_query('select * from litecoin', con=engine).head()

   litecoin_id  trade_date  open_price  close_price
0            1  2015-08-07     4.06334      4.20828
1            2  2015-08-08     4.22099      3.85475
2            3  2015-08-09     3.84339      3.89859
3            4  2015-08-10     3.90080      3.94888
4            5  2015-08-11     3.94874      4.15955

# Bitcoin Upload

In [40]:
#Read the CSV to a dataframe
bitcoin_df = pd.read_csv("Resources/initialData/BTC-USD-clean.csv")

#Print first 5 rows of the dataframe
bitcoin_df.head()

   trade_date  open_price  close_price
0  2015-08-07  278.740997   279.584991
1  2015-08-08  279.742004   260.997009
2  2015-08-09  261.115997   265.083008
3  2015-08-10  265.477997   264.470001
4  2015-08-11  264.342010   270.385986

In [41]:
#Load dataframe into sql table
bitcoin_df.to_sql(name='bitcoin', con=engine, if_exists='append', index=False)

In [20]:
#Query and print first 5 rows from table in sql database
pd.read_sql_query('select * from bitcoin', con=engine).head()

         Date        Open       Close
0  2015-08-07  278.740997  279.584991
1  2015-08-08  279.742004  260.997009
2  2015-08-09  261.115997  265.083008
3  2015-08-10  265.477997  264.470001
4  2015-08-11  264.342010  270.385986

# Federal Deficit Data

In [55]:
#Read the CSV to a dataframe
deficit_df = pd.read_csv("Resources/initialData/clean federal_deficit_trends.csv")

#Print first 5 rows of the dataframe
deficit_df.head()

   year  federal_deficit
0  2015     438899000000
1  2016     587412000000
2  2017     665712000000
3  2018     778996000000
4  2019     984388026331

In [56]:
#Load dataframe into sql table
deficit_df.to_sql(name='federal_deficit', con=engine, if_exists='append', index=False)

In [57]:
#Query and print first 5 rows from table in sql database
pd.read_sql_query('select * from federal_deficit', con=engine).head()

   deficit_id  year  federal_deficit
0           1  2015     438899000000
1           2  2016     587412000000
2           3  2017     665712000000
3           4  2018     778996000000
4           5  2019     984388026331

# Export Data to CSV

In [65]:
coin_query = pd.read_sql("SELECT date_part('year', bitcoin.trade_date), TRUNC(AVG(bitcoin.close_price),3) AS Bitcoin, TRUNC(AVG(litecoin.close_price),3) AS Litecoin, TRUNC(AVG(etherium.close_price),3) AS Etherium, TRUNC(AVG(doge.close_price),6) AS Doge FROM bitcoin FULL OUTER JOIN litecoin ON bitcoin.trade_date = litecoin.trade_date FULL OUTER JOIN doge ON bitcoin.trade_date = doge.trade_date FULL OUTER JOIN etherium ON bitcoin.trade_date = etherium.trade_date GROUP BY date_part('year', bitcoin.trade_date) ORDER BY date_part('year', bitcoin.trade_date)",conn)

coin_df = pd.DataFrame(coin_query)

csv_file = 'yearlyCoin' + '.csv'

csv_file_full = os.path.join(csvpath,csv_file)

coin_df.to_csv(csv_file_full, index=False)

In [8]:
historical_query = pd.read_sql("SELECT 'Bitcoin', trade_date, TRUNC(open_price,2), TRUNC(close_price,2), CONCAT(TRUNC(100.0*(((close_price-open_price)/open_price)),2),'%%') As Percent_Change FROM bitcoin UNION ALL SELECT 'Litecoin', trade_date, TRUNC(open_price,2), TRUNC(close_price,2), CONCAT(TRUNC(100.0*(((close_price-open_price)/open_price)),2),'%%') As Percent_Change FROM litecoin UNION ALL SELECT 'Etherium', trade_date, TRUNC(open_price,2), TRUNC(close_price,2), CONCAT(TRUNC(100.0*(((close_price-open_price)/open_price)),2),'%%') As Percent_Change FROM etherium UNION ALL SELECT 'Doge', trade_date, TRUNC(open_price,3), TRUNC(close_price,3), CONCAT(TRUNC(100.0*(((close_price-open_price)/open_price)),2),'%%') As Percent_Change FROM doge", conn)

historical_df = pd.DataFrame(historical_query)

html_file = 'historicalData' + '.html'

html_file_full = os.path.join(htmlpath,html_file)

historical_df.to_html(html_file_full, index=False)